devdnl/dnx-rtos/src/system/drivers/i2c/stm32f4/i2c.c
        return err;
}

//==============================================================================
/**
 * @brief IO control
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           request                request
 * @param[in ][out]     *arg                    request's argument
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_IOCTL(I2C, void *device_handle, int request, void *arg)
{
        I2C_dev_t *hdl = device_handle;
        int        err = EINVAL;

        if (arg) {
                switch (request) {
                case IOCTL_I2C__CONFIGURE: {
                        const I2C_config_t *cfg   = arg;
                        hdl->config = *cfg;
                        err = ESUCC;
                        break;
                }

                default:
                        err = EBADRQC;
                        break;
                }
        }

        return err;
}

//==============================================================================
/**
 * @brief Flush device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_FLUSH(I2C, void *device_handle)
{
        UNUSED_ARG1(device_handle);

        return ESUCC;
}

//==============================================================================
/**
 * @brief Device information
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *device_stat            device status
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_STAT(I2C, void *device_handle, struct vfs_dev_stat *device_stat)
{
        I2C_dev_t *hdl = device_handle;

        device_stat->st_size  = 0;
        device_stat->st_major = hdl->major;
        device_stat->st_minor = hdl->minor;

        return ESUCC;
}

//==============================================================================
/**
 * @brief  Function release all resource allocated during initialization phase
 * @param  major         major device number
 * @return None
 */
//==============================================================================
static void release_resources(u8_t major)
{
        if (I2C[major] && I2C[major]->dev_cnt == 0) {
                if (I2C[major]->lock) {
                        sys_mutex_destroy(I2C[major]->lock);
                        I2C[major]->lock = NULL;
                }

                if (I2C[major]->event) {
                        sys_semaphore_destroy(I2C[major]->event);
                        I2C[major]->event = NULL;
                }

                if (I2C[major]->initialized) {
                        disable_I2C(major);
                }

                sys_free(cast(void**, &I2C[major]));
        }
}

//==============================================================================
/**
 * @brief  Returns I2C address of current device
 * @param  hdl          device handle
 * @return I2C peripheral address
 */
//==============================================================================
static inline I2C_TypeDef *get_I2C(I2C_dev_t *hdl)
{
        return const_cast(I2C_TypeDef*, I2C_INFO[hdl->major].I2C);
}

//==============================================================================
/**
 * @brief  Clear all DMA IRQ flags (of tx and rx)
 * @param  major        peripheral major number
 * @return None
 */
//==============================================================================
#if ((_I2C1_USE_DMA > 0) || (_I2C2_USE_DMA > 0))
static void clear_DMA_IRQ_flags(u8_t major)
{
        I2C_info_t         *cfg    = const_cast(I2C_info_t*, &I2C_INFO[major]);
        DMA_Stream_TypeDef *DMA_tx = const_cast(DMA_Stream_TypeDef*, cfg->DMA_tx);
        DMA_Stream_TypeDef *DMA_rx = const_cast(DMA_Stream_TypeDef*, cfg->DMA_rx);

        if (cfg->DMA_tx_number < 2) {
                DMA1->LIFCR = ( DMA_LIFCR_CFEIF0
                              | DMA_LIFCR_CDMEIF0
                              | DMA_LIFCR_CTEIF0
                              | DMA_LIFCR_CHTIF0
                              | DMA_LIFCR_CTCIF0 ) << (6 * (cfg->DMA_tx_number - 0));
        } else if (cfg->DMA_tx_number < 4) {
                DMA1->LIFCR = ( DMA_LIFCR_CFEIF2
                              | DMA_LIFCR_CDMEIF2
                              | DMA_LIFCR_CTEIF2
                              | DMA_LIFCR_CHTIF2
                              | DMA_LIFCR_CTCIF2 ) << (6 * (cfg->DMA_tx_number - 2));
        } else if (cfg->DMA_tx_number < 6) {
                DMA1->HIFCR = ( DMA_HIFCR_CFEIF4
                              | DMA_HIFCR_CDMEIF4
                              | DMA_HIFCR_CTEIF4
                              | DMA_HIFCR_CHTIF4
                              | DMA_HIFCR_CTCIF4 ) << (6 * (cfg->DMA_tx_number - 4));
        } else if (cfg->DMA_tx_number < 8) {
                DMA1->HIFCR = ( DMA_HIFCR_CFEIF6
                              | DMA_HIFCR_CDMEIF6
                              | DMA_HIFCR_CTEIF6
                              | DMA_HIFCR_CHTIF6
                              | DMA_HIFCR_CTCIF6 ) << (6 * (cfg->DMA_tx_number - 6));
        }

        CLEAR_BIT(DMA_tx->CR, DMA_SxCR_EN);
        CLEAR_BIT(DMA_rx->CR, DMA_SxCR_EN);
}
#endif

//==============================================================================
/**
 * @brief  Enables selected I2C peripheral according with configuration
 * @param  major        peripheral number
 * @return One of errno value.
 */
//==============================================================================
static int enable_I2C(u8_t major)
{
        const I2C_info_t *cfg = &I2C_INFO[major];
        I2C_TypeDef            *i2c = const_cast(I2C_TypeDef*, I2C_INFO[major].I2C);

        SET_BIT(RCC->APB1RSTR, cfg->APB1ENR_clk_mask);
        CLEAR_BIT(RCC->APB1RSTR, cfg->APB1ENR_clk_mask);

        CLEAR_BIT(RCC->APB1ENR, cfg->APB1ENR_clk_mask);
        SET_BIT(RCC->APB1ENR, cfg->APB1ENR_clk_mask);

        RCC_ClocksTypeDef clocks;
        memset(&clocks, 0, sizeof(RCC_ClocksTypeDef));
        RCC_GetClocksFreq(&clocks);
        clocks.PCLK1_Frequency /= 1000000;

        if (clocks.PCLK1_Frequency < 2) {
                return EIO;
        }

        I2C[major]->use_DMA = false;

#if USE_DMA > 0
        if (cfg->use_DMA) {
                if (!(cfg->DMA_rx->CR & DMA_SxCR_EN) && !(cfg->DMA_tx->CR & DMA_SxCR_EN)) {
                        SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_DMA1EN);

