devdnl/dnx-rtos/src/system/drivers/i2c/stm32f4/i2c.c
                        if (wait_for_DMA_event(hdl, DMA)) {
                                n = count;
                        }
                } else {
#else
                {
#endif
                        while (count) {
                                if (count == 3) {
                                        if (!wait_for_I2C_event(hdl, I2C_SR1_BTF)) {
                                                break;
                                        }

                                        CLEAR_BIT(i2c->CR1, I2C_CR1_ACK);
                                        *dst++ = i2c->DR;
                                        n++;

                                        if (!wait_for_I2C_event(hdl, I2C_SR1_RXNE)) {
                                                break;
                                        }

                                        stop(hdl);
                                        *dst++ = i2c->DR;
                                        n++;

                                        if (!wait_for_I2C_event(hdl, I2C_SR1_RXNE)) {
                                                break;
                                        }

                                        *dst++ = i2c->DR;
                                        n++;

                                        count = 0;
                                } else {
                                        if (wait_for_I2C_event(hdl, I2C_SR1_RXNE)) {
                                                *dst++ = i2c->DR;
                                                count--;
                                                n++;
                                        } else {
                                                break;
                                        }
                                }
                        }
                }

        } else if (count == 2) {
                sys_critical_section_begin();
                {
                        clear_send_address_event(hdl);
                        CLEAR_BIT(i2c->CR1, I2C_CR1_ACK);
                }
                sys_critical_section_end();

                if (wait_for_I2C_event(hdl, I2C_SR1_BTF)) {
                        stop(hdl);

                        *dst++ = i2c->DR;
                        *dst++ = i2c->DR;
                        n     += 2;
                }

        } else if (count == 1) {
                CLEAR_BIT(i2c->CR1, I2C_CR1_ACK);
                clear_send_address_event(hdl);
                stop(hdl);

                if (wait_for_I2C_event(hdl, I2C_SR1_RXNE)) {
                        *dst++ = i2c->DR;
                        n     += 1;
                }
        }

        stop(hdl);

        return n;
}

//==============================================================================
/**
 * @brief  Function transmit selected amount bytes to I2C bus
 * @param  hdl                  device handle
 * @param  src                  data source
 * @param  count                number of bytes to transfer
 * @return Number of written bytes
 */
//==============================================================================
static ssize_t transmit(I2C_dev_t *hdl, const u8_t *src, size_t count)
{
        ssize_t      n    = 0;
        I2C_TypeDef *i2c  = get_I2C(hdl);
        bool         succ = false;

        clear_send_address_event(hdl);

#if USE_DMA > 0
        if (count >= 3 && I2C[hdl->major]->use_DMA) {
                DMA_Stream_TypeDef *DMA = const_cast(DMA_Stream_TypeDef*,
                                                     I2C_INFO[hdl->major].DMA_tx);

                DMA->PAR  = cast(u32_t, &i2c->DR);
                DMA->M0AR = cast(u32_t, src);
                DMA->NDTR = count;

                DMA->CR = ((I2C_INFO[hdl->major].DMA_channel & 7) << DMA_SxCR_CHSEL_Pos)
                        | DMA_SxCR_MINC | DMA_SxCR_TCIE | DMA_SxCR_TEIE | DMA_SxCR_DIR_0;

                if (wait_for_DMA_event(hdl, DMA)) {
                        n    = count;
                        succ = true;
                }
        } else {
#else
        {
#endif
                succ = true;
                while (count) {
                        if (wait_for_I2C_event(hdl, I2C_SR1_TXE)) {
                                i2c->DR = *src++;
                        } else {
                                succ = false;
                                break;
                        }

                        n++;
                        count--;
                }
        }

        if (n && succ) {
                if (!wait_for_I2C_event(hdl, I2C_SR1_BTF))
                        return n - 1;
        }

        stop(hdl);

        return n;
}

//==============================================================================
/**
 * @brief  Event IRQ handler (transaction state machine)
 * @param  major        number of peripheral
 * @return If IRQ was woken then true is returned, otherwise false
 */
//==============================================================================
static volatile u32_t SR; // TEST
static void IRQ_EV_handler(u8_t major)
{
        _GPIO_DDI_set_pin(IOCTL_GPIO_PORT_IDX__TEST2, IOCTL_GPIO_PIN_IDX__TEST2);

        bool woken = false;

        I2C_TypeDef *i2c = const_cast(I2C_TypeDef*, I2C_INFO[major].I2C);

        if (i2c->SR1 & I2C[major]->SR1_mask) {
                sys_semaphore_signal_from_ISR(I2C[major]->event, &woken);
                CLEAR_BIT(i2c->CR2, I2C_CR2_ITEVTEN | I2C_CR2_ITERREN | I2C_CR2_ITBUFEN);
                I2C[major]->unexp_event_cnt = 0;
        } else {
                SR = i2c->SR1; // TEST
                //BTF & TxE
                /*
                 * This counter is used to check if there is no death loop of
                 * not handled IRQ. If counter reach specified value then
                 * the error flag is set.
                 */
                if (++I2C[major]->unexp_event_cnt >= 10) {
                        I2C[major]->error = EIO;
                        sys_semaphore_signal_from_ISR(I2C[major]->event, &woken);
                        CLEAR_BIT(I2C1->CR2, I2C_CR2_ITEVTEN | I2C_CR2_ITERREN | I2C_CR2_ITBUFEN);
                }
        }

        sys_thread_yield_from_ISR(woken);

